<!DOCTYPE html>
<html lang="it">
    <head>
        <title>Acrobatic Arts</title>
        <meta charset="UTF-8" />
        <meta name="author" content="Stefania De Gennaro" />
        <link rel="stylesheet" href="style.css" />
        <script src="javascript.js"></script>
    </head>   
    <body>
        <header>
            <a href="#acrobatic"><img src="img/logobianco.png" id="cambia" alt="logo acrobatic arts" /></a>
        </header>
        <div id="aprichiudi">
                <div id="bar1"></div>
                <div id="bar2"></div>
                <div id="bar3"></div>
            </div> 
        <nav>
            <div id="menu" class="menuChiuso">
                <ol>
                    <li><a href="#acrobatic">Home</a></li>
                    <li><a href="#sfondoPoleDance">Pole dance</a></li>
                    <li><a href="#sfondoAerialSilk">Aerial silk</a></li>
                    <li><a href="#sfondoAerialHoop">Aerial hoop</a></li>
                    <li><a href="#sfondoTrapeze">Trapeze</a></li>
                    <li><a href="#sfondoScopri">Scopri</a></li>
                </ol>
            </div>
        </nav>
        <div id="acrobatic" class="sfondo1">
            <img src="img/logoblu.png" alt="logo blu">
        </div>
        <section id="introduzione">
            <div>
                <h1>
                Un tempo riservate esclusivamente ad acrobati e circensi, le discipline acrobatiche aeree aprono le loro porte a tutti indipendentemente da et&agrave;, genere e passato sportivo.
                </h1>
            </div>
        </section>
        <div id="sfondoPoleDance" class="sfondi"></div>
        <section id="poleDance" class="contenitore">
            <div class="description"> 
                <h2>Pole Dance</h2>
                <h3>la disciplina</h3>
                <p>La pole dance nota anche come <strong>pole sport</strong> &egrave; una disciplina acrobatica, nata dal mix di ginnastica e danza, che prevede l'utilizzo di pali d'acciaio o d'ottone.
                Tra le discipline acrobatiche, &egrave; quella meno conosciuta in Italia perch&eacute; spesso erroneamente confusa con lap dance. L'attivit&agrave; si basa sull'esecuzione di figure acrobatiche, dette <strong>"pole tricks"</strong>, che richiedono notevoli doti di forza, agilit&agrave;, flessibilit&agrave;, coordinazione e resistenza.</p>
                <h3>le origini</h3>
                <p>
                Sebbene sembri nata negli ultimi anni, le radici della pole dance sono ben pi&ugrave; profonde.
                
                Secondo fonti storiche lo sviluppo &egrave; datato al 1920 nel Nord America durante gli anni della depressione quando i circensi utilizzavano i pali dei tendoni per svolgere vere e proprie performance. 
                
                Altre fonti invece indicano la pole dance come sport che deriva direttamente dalla Mallakhamb, pratica indiana del dodicesimo secolo che utilizza una pertica di legno sul quale si esibivano solitamente uomini.
                </p>
            </div>
            <p><button id="palo">il palo</button></p>
            <div id="paginaPalo" class="nascosta">
                <div class="description">
                    <img id="fotoPalo" src="img/" alt="galleriaPalo"/>
                    <span id="indietroPalo" class="indietro">&lang;</span><span id="avantiPalo" class="avanti">&rang;</span>
                    
                    <h3>il palo</h3>
                    <p>Il palo da pole dance &egrave; un'asta metallica in acciaio inossidabile, cromato o in ottone. Le diverse finiture superficiali del materiale donano alla pertica diverse propriet&agrave; di presa.
                    Le dimensioni variano da un diametro di 50mm, che richiede agli atleti un maggior sforzo, fino a 38mm. Attualmente i pali utilizzati durante i campionati hanno una misura pari a 45mm.
                    Il palo pu&ograve; essere sia <strong>statico</strong> che autorotante (<strong>spin</strong>), ovvero che gira su se stesso sfruttando la forza centrifuga del peso corporeo. Questo dona una maggior bellezza negli elementi coreografici ma spesso ne aumenta la difficolt&agrave;.
                    Nel mondo ritroviamo anche il palo cinese, diverso dagli attuali pali da pole dance perch&eacute; pi&ugrave; largo di diametro e con un riverstimento in gomma che favorisce un maggiore grip.
                    L'altezza dei pali &egrave; soggettiva da scuola a scuola. Sono preferibili soffitti di 3/4 metri per pali fissi e a pressione mentre per soffitti pi&ugrave; alti e per zone all'aperto &egrave; possibile utilizzare pali con pedana sottostante.
                    Le case produttrici di pali da pole dance pi&ugrave; famose al mondo sono: X-Pole (Inghilterra), Platinum Stage (Inghilterra), The Pole (Italia), Tecnosystem Pole (Italia), Lupit Pole (Slovenia), Queen Pole (Germania).</p>
                </div>
            </div>
        </section>
        <div id="sfondoAerialSilk" class="sfondi"></div>
        <section id="aerialSilk" class="contenitore">
            <div class="description"> 
                <h2>Aerial silks</h2>
                <h3>la disciplina</h3>
                <p>Aerial silks, in Italiano <strong>tessuti aerei</strong>, sono uno degli strumenti pi&ugrave; ammirati e ricercati da coloro che vogliono entrare a contatto con il mondo dell'acrobatica aerea.
                La disciplina &egrave; basata su evoluzioni coreografiche che si eseguono completamente sospesi in aria a diversi metri da terra.
                L'allenamento con i tessuti pu&ograve; essere praticato sia da uomini che da donne.
                A differenza di quanto si potrebbe pensare, &egrave; una disciplina estremamente sicura, in quanto l'utilizzo dei teli, nel modo giusto, permette di avere la certezza di non cadere controllando il bilancimaneto del proprio peso.</p>
                <h3>le origini</h3>
                <p>Il creatore di questa disciplina fu uno studente circense francese quando nel 1959 present&ograve; la sua performance utilizzando un lungo pezzo di stoffa. 
                Da quella data fino al 1998, quando fu ufficialmente riconosciuto Aerial Silks, numerosi artisti sperimentarono la disciplina donandole la fama attuale.</p>
            </div>
            
        <button id="tessuti">i tessuti</button>
            <div id="paginaTessuti" class="nascosta">
                <div class="description">
                    <img id="fotoTessuti" src="img/" alt="galleriaTessuti"/>
                    <span id="indietroTessuti" class="indietro">&lang;</span><span id="avantiTessuti" class="avanti">&rang;</span>
                    <h3>i tessuti</h3>
                    <p>Il tessuto &egrave; formato da un pezzo lunghissimo di nylon molto resistente che a seconda delle preferenze pu&ograve; essere utilizzato in diversi modi.
                    La prima tecnica &egrave; la pi&ugrave; conosciuta e pi&ugrave; utilizzata nel mondo circense. Consiste nel piegare a met&agrave; il tessuto cos&igrave; da far pendere i due pezzi dal soffitto, dove &egrave; agganciato, a terra e a sceconda della preferenza dell'atleta, le due estremit&agrave; vengono legate con un nodo. Un altro utilizzo, ma meno noto del precedente, prende il nome di <strong>amaca</strong> o <strong>goccia</strong>. 
                    Si tratta sempre di un tessuto diviso in due appeso al soffitto ma, a differenza della modalit&agrave; classica, i ganci sono attaccati alle estremit&agrave; che lasciano il restante scendere a terra formando una specie di culla.
                    La lunghezza &egrave; variabile e dipende dall'uso che ne deve fare l'acrobata.</p>
                </div>
            </div>
    </section>    
    <div id="sfondoAerialHoop" class="sfondi"></div>
    <section id="aerialHoop" class="contenitore">
        <div class="description"> 
            <h2>Aerial hoop</h2>
            <h3>la disciplina</h3>
            <p>Aerial hoop, in italiano <strong>cerchio aereo</strong> &eacute; una tra le discipline acrobatiche pi&ugrave; affascinanti. 
            &Egrave; un'insieme di figure acrobatiche realizzate con un cerchio di grandi dimensioni sospeso al soffitto tramite corde e moschettoni. Al suo interno, gli acrobati o meglio chiamati "<strong>aerialist</strong>", eseguono performance a diversi metri da terra. 
            La disciplina pu&ograve; essere praticata sia da uomini che da donne anche se generalmente &egrave; pi&ugrave; ammirata dal pubblico femminile.
            <h3>le origini</h3>
            Aerial Hoop, come Aerial Silk, ha radici nel mondo circense e solo negli ultimi anni ha aperto le proprie porte a tutti indipendentemente da genere ed et&agrave;.
            Il periodo preciso di comparsa di questa disciplina &egrave; piuttosto vago. Il primo utilizzo del cerchio come mezzo per le esibizioni fu nel 1893 a New York in una pubblicit&agrave; e dagli anni 2000 in poi nacquero vere e proprie esibizioni del Cirque du Soleil.</p>
        </div>
        
    <button id="cerchio">il cerchio</button>
            <div id="paginaCerchio" class="nascosta">
                <div class="description">
                    <img id="fotoCerchio" src="img/" alt="galleriaCerchio"/>
                    <span id="indietroCerchio" class="indietro">&lang;</span><span id="avantiCerchio" class="avanti">&rang;</span>
                    <h3>il cerchio</h3>
                    <p>Il cerchio, noto anche come <strong>lyra</strong> o <strong>anello aereo</strong>, &egrave; un apparecchio circolare (simile ad un hula hoop) appeso al soffitto.
                    Il materiale che lo costituisce &egrave; generalmente acciaio ricoperto da tape e ha un diametro di circa 90 cm ma che varia in base alla grandezza e forza degli atleti.
                    I cerchi aerei possono essere cavi o solidi ed essere utilizzati, a seconda della loro leggerezza e in base agli attacchi presenti, in maniera statica, rotante o, nel caso dei cerchi con doppio attacco, oscillante.
                    Il cerchio &egrave; appeso al soffitto con telai che si collegano all'apparecchio in un punto (configurazione ascheda singola) o in due punti (configurazione a doppia scheda).
                    Il numero di attacchi varia da come verr&agrave; utilizzato il cerchio, dall'effetto desiderato e dal comfort dell'atleta.</p>
                </div>
            </div>
    </section> 
    <div id="sfondoTrapeze" class="sfondi"></div>
    <section id="trapeze" class="contenitore">
        <div class="description"> 
            <h2>Trapeze</h2>
            <h3>la disciplina</h3>
            <p>Trapeze, in italiano <strong>trapezio</strong> &eacute; la disciplina acrobatica aerea sicuramente pi&ugrave; nota grazie alla quantit&agrave; di performance che il circo le dedica.
            Esistono diverse tipologie di trapezio, tra cui quello statico, ad altalena e quello volante.
            Il trapezio statico consiste nel creare figure acrobatiche mostrando notevoli doti di forza e flessibilit&agrave;. 
            Il trapezio ad altalena invece sfrutta la dinamicit&agrave; ondeggiando da un lato all'altro del soffitto su cui &eacute; appeso. 
            Il trapezio volante &egrave; una tipologia differente in genere praticata in coppia. Gli acrobati si incrociano in volo combinandosi in prese del tutto scenografiche per poi ridividersi contemporaneamente in due trapezi differenti sfruttando il coordinamento delle oscillazioni.
            <h3>le origini</h3>
            <p>Le origini del trapezio sono sicuramente riconducibili al mondo del circo.
            L'inventore fu l'acrobata francese <strong>Jules L&eacute;tard</strong> che all'et&agrave; di 18 anni speriment&ograve; l'arte del trapezio sospeso sopra ad una piscina. Rimase uno degli artisti pi&ugrave; famosi in questa attivit&agrave;, al punto di ispirare nel 1867 la canzone <i>"The Daring Young Man on the Flying Trapeze"</i> di George Leybourne.</p>
        </div>
        
    <button id="trapezio">il trapezio</button>
            <div id="paginaTrapezio" class="nascosta">
                <div class="description">
                    <img id="fotoTrapezio" src="img/" alt="galleriaTrapezio"/>
                    <span id="indietroTrapezio" class="indietro">&lang;</span><span id="avantiTrapezio" class="avanti">&rang;</span>
                    <h3>il trapezio</h3>
                    <p>Il trapezio &egrave; composto da una barra orizzontale alle cui estremit&agrave; sono fissate due corde o cinghie di supporto che arrivano al soffitto.
                    La barra pu&ograve; essere costituita da diversi materiali. Esistono barre metalliche, in metallo ricoperto da gomma per facilitare la presa del corpo e barre in legno.
                    Il diametro &egrave; in genere di 30mm ma dipende dalla forza, dalle preferenze e dall'utilizzo dell'acrobata.</p>   
                </div>
            </div>
    </section>
    <div id="sfondoScopri"></div>
    <section id="scopri" class="contenitore">
        <div class="scopri">  
        <h2>Scopri il <strong>pole trick</strong> pi&ugrave; adatto a te:</h2>
        <h4>Inserisci i dati e seleziona il tuo livello</h4>
            
            <table>
                <tr><td><h3>Sesso:</h3></td> 
                    <th><div id="donna" 
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">donna</span>&female;</span></div></th>
                    <th><div id="uomo"
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">uomo</span>&male;</span></div></th></tr>
            </table>
            <hr>
            <table>
                <tr><td><h3>Forza:</h3></td> 
                    <th><div id="poca"
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">livello basso</span>&starf;</span></div></th> 
                    <th><div id="modesta"
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">livello medio</span>&starf;</span></div></th> 
                    <th><div id="molta"
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">livello alto</span>&starf;</span></div></th></tr>
                <tr><td><h3>Flessibilit&agrave;:</h3></td> 
                    <th><div id="basso"
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">livello basso</span>&starf;</span></div></th> 
                    <th><div id="medio" 
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">livello medio</span>&starf;</span></div></th> 
                    <th><div id="alto"
                             class="nonCliccato"><span class="tooltip"><span class="tooltiptext">livello alto</span>&starf;</span></div></th></tr>
            </table>
            <p>
            <button id="refresh" class="nascosto">Refresh</button>
            </p>
        </div>
        <div id="risultato" class="description"></div>
    </section>
    <footer>
        <div class="chiSono">
            <div class="immagine-stefania"><img src="img/Stefania.png" alt="fotoPersonale"/></div>
            <h2>Chi sono</h2>
            <p>
            Mi chiamo Stefania, ho 20 anni e sono un'atleta di pole sport. 
            </p>
            <p>
            Sono cresciuta nascondendomi dietro la musica di tante coreografie per poi rinascere, grazie alla passione per la disciplina che svolgo, come la persona che sono oggi. 
            </p>
        </div>
        <div>
            <h2>Il progetto</h2>
            <p>
            Sito realizzato da <i><abbr title="stefi.degennaro@gmail.com">Stefania De Gennaro</abbr></i> (564572) per il corso di PPW (progettazione e programmazione web), corso di laurea in Informatica Umanistica anno 2017/2018.
            </p>
            <p>
            Tutte le pagine HTML e CSS presenti sul sito sono state validate secondo gli standard W3C.
            Le immagini utilizzate appartengono al sito <a href="http://www.alloyimages.com/">Alloy Images</a> e sono state editate da me con Photoshop CC 2014.
            </p>
            <p>
            <a href="https://jigsaw.w3.org/css-validator/check/referer"><img style="border:0;width:60px;height:22px" src="https://jigsaw.w3.org/css-validator/images/vcss-blue" alt="CSS Valido!" /></a>
            </p>
        </div>
    </footer>
    </body>
</html>